Библиотека/src/Catalogs/Книги/Книги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Книги</name>
  <attributes>
    <name>Страниц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Издательство</name>
    <type>
      <types>CatalogRef.Издательства</types>
    </type>
  </attributes>
  <attributes>
    <name>ISBN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяКомпактДиск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ББК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УДК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Диск</name>
    <type>
      <types>CatalogRef.Диски</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодИздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тираж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обложка</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Авторы</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Авторы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Библиотека/src/AccumulationRegisters/КнигиВБиблиотеке/КнигиВБиблиотеке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КнигиВБиблиотеке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.Операция</types>
    </type>
  </attributes>
  <dimensions>
    <name>Книга</name>
    <type>
      <types>CatalogRef.Книги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоРазмещения</name>
    <type>
      <types>CatalogRef.Абоненты</types>
      <types>CatalogRef.МестаРазмещения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Библиотека/src/Catalogs/Книги/ManagerModule.bsl
Функция СоздатьКнигу(Наименование, ПолноеНаименование, Описание, Авторы, Издательство, Страниц, ГодИздания, ИнвентарныйНомер, ISBN, ББК, Штрихкод, ФайлОбложки) Экспорт
	
	НоваяКнига = Справочники.Книги.СоздатьЭлемент();
	
	НоваяКнига.Наименование = Наименование;
	НоваяКнига.ПолноеНаименование = ПолноеНаименование;
	НоваяКнига.Страниц = Страниц;
	НоваяКнига.ГодИздания = ГодИздания;
	НоваяКнига.ИнвентарныйНомер = ИнвентарныйНомер;
	Для Каждого Автор Из Авторы Цикл
		НоваяСтрока = НоваяКнига.Авторы.Добавить();
		НоваяСтрока.Автор = Автор;
	КонецЦикла;
	НоваяКнига.Издательство = Издательство;
	НоваяКнига.Описание = Описание;
	НоваяКнига.ISBN = ISBN;
	НоваяКнига.ББК = ББК;
	НоваяКнига.Штрихкод = Штрихкод;
	НоваяКнига.Обложка = ФайлОбложки;
	Попытка
		НоваяКнига.Записать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось создать книгу";
		СообщениеПользователю.Сообщить();
		ОбщегоНазначения.ЗафиксироватьОшибку(СообщениеПользователю.Текст, ОписаниеОшибки, Метаданные.Справочники.Книги, Наименование);
	КонецПопытки;
	
	Возврат НоваяКнига.Ссылка;
	
КонецФункции

Процедура ПечатьФормуляра(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.Книги.ПолучитьМакет("Формуляр");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КнигиАвторы.Автор,
	|	КнигиАвторы.Ссылка.Наименование,
	|	КнигиАвторы.Ссылка.Страниц,
	|	КнигиАвторы.Ссылка.Издательство,
	|	КнигиАвторы.Ссылка.ИнвентарныйНомер
	|ИЗ
	|	Справочник.Книги.Авторы КАК КнигиАвторы
	|ГДЕ
	|	КнигиАвторы.Ссылка = &Ссылка";
	Запрос.Параметры.Вставить("Ссылка", Ссылка[0].Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Формуляр = Макет.ПолучитьОбласть("Формуляр");
	ТабДок.Очистить();
	Наименование = "";	
	Пока Выборка.Следующий() Цикл
		Наименование = Наименование + Выборка.Автор+ ",";
	КонецЦикла;
	формуляр.Параметры.ИнвентарныйНомер = "№ " + СокрЛП(Ссылка[0].ИнвентарныйНомер);
	Формуляр.Параметры.Наименование =  Ссылка[0].Наименование + " " + Ссылка[0].Издательство + " " + Наименование + "стр." + Ссылка[0].Страниц;
	ТабДок.Вывести(Формуляр);
	
КонецПроцедуры

// Возвращает текущее расположение книги
//
// Параметры
//  <Книга> 	- <СправочникСсылка.Книги>  	- ссылка на книгу расположение которой надо получить
//
//  <Дата> 		- <Дата>  						- момент времени на который надо получить расположение, если не задано то ТекущаяДата()
//
// Возвращаемое значение:
//   <СправочникСсылка.Абоненты; СправочникСсылка.МестаРазмещения>   - текущее расположение книги или Неопределено если в регистре нет записи
//
Функция ПолучитьРасположениеКниги(Книга, Дата=Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КнигиВБиблиотекеОстатки.МестоРазмещения
	|ИЗ
	|	РегистрНакопления.КнигиВБиблиотеке.Остатки(&Дата, Книга = &Книга) КАК КнигиВБиблиотекеОстатки
	|ГДЕ
	|	КнигиВБиблиотекеОстатки.КоличествоОстаток = 1";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Книга", Книга);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.МестоРазмещения;
	КонецЦикла;
	
	Возврат Неопределено;
	
	
КонецФункции // ПолучитьРасположениеКниги()
